{{section-equipment}}


Special piece of Equipment that allows other Models to regain consciousness.

{{skillbox |green| MEDIKIT | SHORT SKILL }}
{{skill-label | Non-Lethal }}
{{requirements}}
* A MediKit's '''target''' must be an '''Allied Model''' in '''Unconscious '''State, unless certain scenario rules say otherwise. 
* A MediKit can be used in one of two ways, each one with their own Requirements:
** To use it '''remotely''', the user must have [[LoF]] to the target. 
** To use it as a piece of contact equipment, the user must be in '''[[Silhouette]] contact''' with the target. 
{{effects}}
* Used remotely, a MediKit is considered a Non-Lethal [[BS Weapon]]. If the user passes a [[BS Attack]] Roll, applying the corresponding [[MODs]] (for [[Range]], [[Cover]], etc.), the target will perform a single '''PH''' Roll.
* A MediKit can also be used in [[Silhouette]] contact. To do so, the user must spend one Short Skill, without the need for a Roll, and their target will perform a '''[[PH]]''' Roll.
* In both cases, '''by passing the [[PH]] Roll''', the target's [[Unconscious]] State is cancelled, by recovering a single point of their Wounds Attribute. If '''the PH Roll is failed''', the target automatically enters the [[Dead]] State and is removed from the game table. 
* A MediKit's target does not perform a [[Saving Roll]]. 
* By using a MediKit, a Trooper may be recovered from the Unconscious State as many times as necessary, as long as they pass the corresponding '''[[PH]]''' Roll. 
{{c1}}
* If, due a Special Skill or rule, a Trooper receives more than one successful hit or use of MediKit during the same Order, if any of the corresponding '''[[PH]]''' Rolls is failed, the Trooper automatically enters the [[Dead]] State. Even if the Trooper passes every '''[[PH]]''' Roll, they will only recover a single point of their [[Wounds]] Attribute. 
{{c1end}}{{n4list}}
* If, due a Special Skill or rule, a Trooper receives more than one successful hit or use of MediKit during the same Order, if any of the corresponding '''[[PH]]''' Rolls is successful, the Trooper automatically cancel [[Unconscious State]]. Even if the Trooper passes every '''[[PH]]''' Roll, they will only recover a single point of their [[Wounds]] Attribute. 
{{n4end}}


{{weapon}}
{{weaponrow|MediKit|+3|0|-6|--|--|--|--|-|1|-|-|[[Non-Lethal]], [*see above]}}
|}


{{section-equipment}}



[[Category:Equipment]]