{{section-combat-module}}
{{section-common-skills}}


Skill that allows [[Close Combat]] fighting, striking an adversary in [[Silhouette]] contact.

{{skillbox |greenyellow| CC ATTACK | SHORT SKILL / ARO}}
{{skill-label | Attack}}
{{Requirements}}
*Be using a Melee Weapon, a Skill, or piece of Equipment that allows for a [[CC Attack]]. 
*Be in [[Silhouette]] contact with an enemy [[Model]] or [[Target]].
{{effects}}
*Allows use of the [[CC]] Attribute to fight in [[Close Combat]] (CC)''.
*By declaring a CC Attack, Troopers may only use those Weapons with the [[CC Trait|'''CC''' Trait]].
*If a Trooper has several targets and a '''Burst''' value that is higher than 1, the player must clarify how they are dividing the [[Burst]] when declaring the CC Attack.
*In the Resolution step, check which [[MODs]] to apply, and make the [[CC Attack]] Rolls using the corresponding Attribute. 
*For each success obtained in CC Attack Rolls, the target must perform a [[Saving Roll]] (See [[Damage]]).
*'''Coup de Gr&acirc;ce''': If the Enemy Target is in [[Unconscious]] or [[Shasvastii-Embryo State]] when declaring the CC Attack, then, without needing to perform a roll, the target automatically goes from Unconscious to Dead State without the possibility of making a [[Saving Roll]]. {{seefaq | You cannot Coup de Gr창ce a Trooper that is using Dogged or No Wound Incapacitation.}}


== FAQs & Errata ==

{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.0, Jan 2021 |
q = Q: Do Pistols with (+1B) or (+2B) apply the additional Burst in CC Mode? |
a = A: Yes, but only in the Active Turn. |
related = [[CC Attack]], [[Pistols]], [[Skills and Equipment in Infinity]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.0, Jan 2021 |
q = Q: How do Dogged and No Wound Incapacitation interact with Coup de Gr창ce, and with Troopers that have STR instead of Wounds? |
a = A: An Unconscious Trooper that has activated the Dogged or No Wound Incapacitation Special Skills cannot be the target of a Coup de Gr창ce, the standard CC Attack Rolls must be made.
If the Trooper has STR instead of Wounds, losing a further point of their STR Attribute will have the same effect as losing a further point of their Wounds Attribute - they enter the Dead State. |
related = [[CC Attack]], [[Dogged]], [[No Wound Incapacitation]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.1.1, Dec 2021 |
q = Q: How does Protheion interact with Coup de Gr창ce, and with the State: Dead Trait? |
a = A: In both situations, the target passes to Dead State and the Protheion user counts as inflicting a single Wound. |
related = [[CC Attack]], [[Melee Weapon Profile]], [[Protheion]], [[Traits]] }}


[[Category: Combat Module]]