{{section-special-skills}}


Troopers with Climbing Plus are particularly gifted in or equipped for climbing and vertical relocation. 

{{skillbox |black| CLIMBING PLUS | AUTOMATIC SKILL }}
{{skill-label|Movement, Optional}}
{{requirements}}
*At the end of the movement, Troopers must be able to place themselves on a surface that is equal or larger than their base. 
{{effects}}
*This Special Skill alters the user's [[Climb]] Skill from an Entire Order Skill to the Short Movement Skill [[Move]]. 
*Climbing Plus allows the user to move along vertical surfaces as if performing a normal Movement on a horizontal surface. 
*By turning [[Climb]] into the Short Movement Skill [[Move]], the Climbing Plus Special Skill allows its user to perform other Short Movement Skills or Short Skills (for example: [[Move]] + [[BS Attack]]) while moving on a vertical surface, or if hanging from a height (See [[Trooper Activation]]).
*As with the [[Climb]] Skill, Troopers using Climbing Plus '''do not''' benefit from [[Partial Cover]] MODs while they are on a vertical surface.
*For visualization purposes, Troopers using this Skill move with at least half of their base's underside in contact with the vertical surface, as indicated in the Requirements of the [[Move]] and [[Climb]] Skills. {{seefaq | You must use the full width if available.}}
*During the [[Reactive Turn]], Climbing Plus allows its owner to react in ARO, if applicable, while being on a vertical surface. 
{{n4list}}
* If the Trooper is or becomes [[Impetuous]] (due to having the [[Frenzy]] Characteristic or any other effect), when they activate in the [[Impetuous Phase]] they can use Climb whenever the list of allowed Skills says 'Move'.
{{n4end}}


{{Important-start}}
Troopers cannot be deployed on vertical surfaces during the '''[[Deployment Phase]]''' or during the game.
{{important-end}}


{{Remember-start}}
*When declaring the use of Climbing Plus, the complete and exact trajectory that Trooper will perform must be specified so the rival player may declare all their AROs. 
*Troopers have a 360˚ [[LoF]] during their entire trajectory.
{{important-end}}


==Examples==
{{greybox-start | Example of Climbing Plus}}
{{image | name=eng-climbing-plus.jpg | style=512border }}

Spending an Order, the Trooper declares [[Move]] as the first Skill of their Order. Thanks to their Climbing Plus Special Skill, as the Trooper moves their first 2 inches and reaches the obstacle, they may continue their movement on the vertical surface, as if it was a horizontal surface. 

Likewise, with the second Skill of their Order, they can choose to keep moving, or can declare any other Short Skill or Short Movement Skill such as [[BS Attack]], [[Discover]], etc.  

Since there are no enemies in sight, the Trooper keeps moving. 

With a second Order, they declare [[Move]] + [[Move]], so they climb down the obstacle and advance until they have used all their movement. 
{{greybox-end}}


== FAQs & Errata ==

{{faqbox |
type = faq |
title = N4 FAQ |
version = Updated 1.1.1, Dec 2021 |
q = Q: While using Move or Climb, can you move 'through' a corner {{erratahighlight}}or overhang the edge of the surface{{erratahighlight-end}}, in the same way that you can move through a space that's half the width of the Trooper's base? |
a = A: No. If the space is wide enough for the Trooper's full base, you must use the full base.

Examples: 

{{image | name=dual-faq10-1.jpg | style= 256border }}
{{image | name=dual-faq10-2.jpg | style= 256border }}
{{image | name=dual-faq10-3.jpg | style= 256border }} |
related = [[Climb]], [[Climbing Plus]], [[Move]] }}


{{section-special-skills}}





[[Category:Special Skills]]