{{section-special-skills}}


{{n4only}}
{{n4list}}
This Special Skill generates static replicas of the user to deceive the enemy.

{{image | name=decoy-10.jpg | style= 128inline }}
{{image | name=decoy-20.jpg | style= 128inline }}

{{skillbox |purple| DECOY | DEPLOYMENT SKILL }}
{{skill-label | Optional }}
{{effects}}
* When deploying, the user may deploy up to two Decoy Markers (DECOY-1 / DECOY-2) in addition to the Trooper, observing the [[Coherency]] rule in regards to the user's Model and respecting the [[Deployment Phase|Deployment]] Rules.
* The number of additional Decoys that the Trooper may place during their Deployment is indicated between brackets: Decoy (1) or Decoy (2).
* If the user is Deployed in Marker form instead of as a Model, for example in [[Camouflaged]] or [[Impersonation State]]s, the player will place (CAMO) and (IMP) Markers on the table instead of the Decoy Markers. 
* The Trooper with this Special Skill is represented by up to three Decoys: the Decoy 1 Marker, the Decoy 2 Marker and the actual Model, or Marker if the user has that choice. The player must note in secret which of these Decoys represents the real user of this Special Skill, with the others being mere replicas.
* The replicas do not hide a Trooper, Weapon or piece of Equipment and '''they remain static on the gaming table'''.
* DECOY-1 and DECOY-2 Markers are placed on the gaming table when a Trooper is replicated in Model form, so they must be considered as Models for [[LoF]] purposes and may be targeted.
* A replica Decoy must be automatically removed from the gaming table as soon as it is [[Discover]]ed by the adversary, makes a [[Saving Roll]], or when the Trooper with this Special Skill reveals themself or is Discovered.
* The real Decoy user is revealed, removing all the replicas and placing the Trooper in its real position, whenever:
** The Decoy user '''declares''' an Attack, [[Look Out]]! or any Skill that requires a Roll. 
** The Decoy user fails the [[Infiltration]] Roll, the [[Combat Jump]] Roll, or declares an '''[[Entire Order]]''' of any kind, other than [[Cautious Movement]].
** An enemy model enters [[Silhouette contact]] with the Decoy user.
** The Decoy user is '''[[Discover]]ed'''.
** The Decoy user makes a [[Saving Roll]].
** The Decoy user becomes [[Impetuous]] (due to the [[Frenzy]] Characteristic or any other effect) or enters [[Retreat! State]].
* If the user was hidden as a Decoy Marker, replace it with the user's Model, facing whatever direction the owning player chooses.
* When replacing the Marker with the Model, the player must provide their adversary with the Trooper's complete [[Public Information]]. 


{{Important-start}}
'''Decoys, weapons, Equipment and States:'''<br>
The replicas cannot replicate those Deployable weapons or pieces of Equipment represented by a Token or Model ([[TinBot]]s, [[FastPanda]]s, [[SymbioMate]]s, [[Mines]] deployed by the [[Minelayer]] Special Skill...) the Decoy user could have.

However, the replicas replicate all the [[State]] Tokens ([[Prone]], [[Unloaded]]...) the Decoy user has.

'''Decoy and Fireteam:'''<br>
A Trooper using Decoy cannot be part of a [[Fireteam]]. If a member of a Fireteam is deployed using Decoy, then it will automatically cease being part of the Fireteam.

'''Decoy and Coordinated Orders:'''<br>
Troopers using Decoy cannot be part of [[Coordinated Orders]].

'''Decoy and Airborne Deployment:'''<br>
When deploying a Trooper using Decoy and a Skill with the [[Airborne Deployment]] Label, the player must perform a [[Coherency]] Check as if it were the [[Deployment Phase]], even though this is during the game.
{{important-end}}


{{n4end}}



[[Category:Special Skills]]