{{section-fireteams}}


{{n4annex}}
{{n4list}}
{{update | March 2022}}
== Fireteam Creation ==
Each Army has a Fireteams Chart that indicates the quantity and type of Fireteams that the player may create during the game.
* '''During the [[Deployment Phase]]''', place a Fireteam Leader Token (FIRETEAM LEADER), or equivalent, beside one of the Troopers that meet the Requirements of this rule.<br>In that moment, the player must make a [[Coherency]] Check relative to the chosen Fireteam Leader.
* '''During the game''', spend a [[Command Token]] and place a Fireteam Leader Token (FIRETEAM LEADER) beside one of the Troopers that meet the instructions of the [[Fireteams Chart]] of their Army.

{{important-start}}
When a Fireteam is created, the player must declare which Troopers are part of it.
{{important-end}}

== Fireteam Types ==
The types of Fireteams that the player may use during a match are:

===Fireteam Duo===
{{image | name=n4-fireteam-type-duo-450.png | style=128 }}
When created, a Fireteam Duo must contain two Troopers.

===Fireteam Haris===
{{image | name=n4-fireteam-type-haris-450.png | style=128 }}
When created, a Fireteam Haris must contain three Troopers.

===Fireteam Core===
{{image | name=n4-fireteam-type-core-450.png | style=128 }}
When created, a Fireteam Core must contain a minimum of three and a maximum of five Troopers.


==General Rules of Fireteams==
* The members of a Fireteam must observe the [[Coherency]] rule in regards to the Fireteam Leader.
* A Trooper cannot simultaneously be part of more than one Fireteam.
* All members of a Fireteam must belong to the same [[Combat Group]].
* When a [[Regular Order]] is spent on a member of a Fireteam, they automatically become the Fireteam Leader. Additionally, they activate the other members of the Fireteam (see [[Fireteam Order]]).
* Fireteams must contain of a minimum of two Troopers and a maximum of five Troopers (always observing the Army’s [[Fireteams Chart]]). 
* Fireteams allow the use of the [[Fireteam Bonuses]] for two, three, four, or five members depending on the Composition and number of Troopers in the Fireteam.


==Fireteams and CC==
* In '''[[Close Combat]]''', whether in the Active or Reactive Turn, when several members are engaged in the same CC, '''only''' the Fireteam Leader can be chosen to perform the CC Roll, applying the [[Close Combat with Multiple Troopers]] rule.
* In the Reactive Turn, if the Fireteam Leader is not engaged in that CC, the player must choose '''one''' of the Fireteam members who are engaged in that CC to perform the CC Roll, applying the Close Combat with Multiple Troopers rule.
* In ARO, the enemy will be able to target any Fireteam member engaged in the CC, but only one of them.


==Fireteams, Frenzy and Impetuous==
* While in a Fireteam, the [[Frenzy]] and [[Impetuous]] Special Skills of a Trooper are '''not''' applied. 
* If the Trooper leaves the Fireteam, any Frenzy and Impetuous Special Skills will apply again, in whatever state they were in when the Trooper joined the Fireteam.
* Any Fireteam that is an exception to this rule will specify this in its description.


==Fireteams and Suppressive Fire State==
A Trooper stops being part of a Fireteam if they enter [[Suppressive Fire State]]. In addition, a Trooper’s Suppressive Fire State is cancelled when joining a Fireteam.


==Fireteams and Comms Attack==
In the Reactive Turn, if the Fireteam has more than one [[Hacker]] and the player declares a Hacking ARO, every reactive Hacker may use a different [[Hacking Program]].


==Fireteams, Motorcycles, and Pilots==
[[Pilot]]s—and Troopers possessing a [[Motorcycle]]—can [[General Movement Rules|Mount or Dismount]] from their Motorcycle or TAG and use their new Unit Profile without leaving their Fireteam.

However, in the case of a Pilot (Remote), if the player performs a Reset to regain control of their TAG, it automatically leaves the Fireteam.

{{update-end}}


{{section-fireteams}}

{{n4end}}











[[Category:Fireteams]]
[[Category: N4 Annex]]