{{section-special-skills}}


{{n4only}}
{{n4list}}
'''Troopers with this Special Skill are aboard a Vehicle or TAG. '''

{{skillbox |black| PILOT | AUTOMATIC SKILL}}
{{skill-label | Obligatory }}
{{effects}}
* By performing any Skill with the [[Movement]] Label, Pilots may Mount or Dismount their own Vehicle or TAG, and '''only''' their own Vehicle or TAG (see the [[General Movement Rules]]).
* If the '''Vehicle or TAG is in [[Unconscious]] State''', the Pilot can still Dismount and use their Profile.
* A Vehicle or TAG whose Pilot is Dismounted cannot spend [[Orders]] or [[ARO]]s using their Vehicle or TAG Unit Profile
* The Vehicle or TAG whose Pilot is Dismounted is still considered a valid target for the opponent.
* Pilots of a Vehicle or TAG in Unconscious State are not considered to be survivors or casualties for [[Victory Points]], [[Retreat!]] or any other purposes. Only the TAG or Vehicle counts. 
* If the Pilot is Dismounted and enters [[Dead]] State, the Vehicle or TAG is considered a casualty and must be removed from the gaming table along with the Pilot's Model. 
* Pilots of a Vehicle or TAG in Unconscious State do not contribute Orders of any kind.
* When Dismounting from a TAG or Vehicle, any Game [[State]]s that the TAG or Vehicle was in will also be applied to the Pilot (if applicable), with the exception of Unconscious. {{seefaq | There are exceptions for Possessed State.}}
* When Mounting a TAG or Vehicle, the TAG or Vehicle Profile will apply all Game States that the TAG was in and all Game States the Pilot was in (if applicable).
* If the Pilot is a Trooper vulnerable to hacking or suffering the effect of [[E/M Ammunition]], no Hacking Program may be used against them and the E/M effect will not be applied to them as long as their Model is not on the gaming table.
* '''Pilot (Remote):'''
** As an exception to this rule, if the Remote Pilot is on the gaming table in an [[Isolated]], Immobilized ([[IMM-A]] or [[IMM-B]]) or [[Null]] State, their player may spend an Order or ARO to declare Reset with the Vehicle or TAG to regain control of it. If this Reset is a Normal Roll with no MODs applied, it will be an automatic success and, after declaring this, the Remote Pilot is removed from the gaming table. 


== FAQs & Errata ==

{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.0, Jan 2021 |
q = Q: How does the Possessed State interact with Pilots, Dismounting, and Escape Systems? |
a = A: When a TAG is in Possessed State, its Pilot cannot Mount or Dismount. If a TAG's Escape System takes effect while the TAG is in Possessed State, the operator profile will not be in Possessed State. |
related = [[Escape System]], [[General Movement Rules]], [[Pilot]], [[Possessed State]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.2, Jan 2022 |
q = Q: Can a Pilot use the Tactical Awareness or Lieutenant Order generated by the TAG profile? |
a = A: No. The Pilot does not have the Tactical Awareness or Lieutenant Special Skill, so cannot be activated with the Order. |
related = [[Lieutenant]], [[Pilot]], [[Tactical Awareness]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.2, Jan 2022 |
q = Q: If a TAG is in a Fireteam and the TAG's Pilot or Pilot (Remote) Dismounts, will the Pilot be a member of the Fireteam? |
a = A: Yes. The Pilot will take the TAG's place as a member of the Fireteam, and vice-versa if the Pilot Mounts the TAG again. |
related = [[Pilot]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.2, Jan 2022 |
q = Q: If a Pilot (Remote) is in a Fireteam and the TAG regains control with a successful Reset (removing the Pilot from the gaming table), does the TAG take the Pilot's place in the Fireteam? |
a = A: No. |
related = [[Pilot]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.1.1, Dec 2021 |
q = Q: If a Pilot or Remote Pilot has a Supply Box, an item from a Panoply or any Synched Civilians, what happens if the Pilot or Remote Pilot Mounts his TAG again? |
a = A: The TAG will have the Supply Box or item from the Panoply and will have any Civilians Synched to them. The same applies if the Pilot or Remote Pilot Dismounts from a TAG that has a Supply Box, an item from a Panoply or any Synched Civilians. |
related = [[Pilot]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.2, Jan 2022 |
q = Q: Do Pilots or Pilots (Remote) count towards Dominating a ZO? |
a = A: No. |
related = [[Pilot]] }}

{{n4end}}



[[Category:Special Skills]]