{{section-special-skills}}


{{n4only}}
{{n4list}}
Remote Presence technology is a characteristic trait of unmanned TAGs and Remotes. Remotes are controlled by a pseudo-AI and a suite of expert programs that govern their combat behavior with precision and fearless logic. TAGs, on the other hand, benefit from the autonomy of a human pilot, but Remote Presence technology allows these pilots, miles away from the battlefield, to focus on performance instead of safety.

{{skillbox |black| REMOTE PRESENCE | AUTOMATIC SKILL }}
{{skill-label | Obligatory }}
{{effects}}
* Troopers with Remote Presence and the [[STR]] Attribute have two distinct levels of [[Unconscious]] State.
: When the Trooper loses the last point of their STR Attribute, they enter Unconscious State like any other Trooper would. However, if the Trooper receives damage again and loses one further STR point, it does not enter [[Dead]] State as usual, but instead enters a second level of Unconscious State, signified by a second Unconscious Token (UNCONSCIOUS). Only if the user loses further STR points does it fall Dead and is removed from play.
* Regardless of which level of Unconscious State the Trooper is in, with a single successful WIP Roll with the [[Engineer]] Special Skill, or PH Roll with a [[GizmoKit]], the Trooper will recover lost STR until they have '''1 point''' of STR and will cancel their Unconscious State.
* Additionally, when using Engineer (or other Special Skills or piece of Equipment that specifically say so) to repair a Trooper with Remote Presence, you may expend [[Command Tokens]] to reroll a failed WIP Roll.


== FAQs & Errata ==

{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.1.1, Dec 2021 |
q = Q: How do Remote Presence, STR, and the Dogged and No Wound Incapacitation Special Skills interact? |
a = A: You can activate Dogged or No Wound Incapacitation when the Trooper enters any level of Unconscious State, but not if the Trooper is already in Unconscious State. |
related = [[Dogged]], [[No Wound Incapacitation]], [[Remote Presence]], [[Unconscious]] }}

{{n4end}}



[[Category:Special Skills]]