{{section-special-skills}}


{{n4only}}
{{n4list}}
Troopers possessing this Special Skill are deployed on the battlefield inside a semi-buried camouflaged capsule, to increase their chances of survival. <s>They can hatch voluntarily in the player’s second Active Turn, changing to a different Troop Profile.</s> {{seefaq}}

{{image | name=seed_embryo0.jpg | style=128 }}

{{skillbox |purple| SEED-EMBRYO | DEPLOYMENT SKILL }}
{{skill-label | Obligatory }}
{{effects}}
* Troopers with this Special Skill have a dual Unit Profile with two profiles (Seed Form and Developed Form). 
* The user must deploy using the Seed-Embryo profile.
* If the user's Seed-Embryo profile has the [[Camouflage]] Special Skill, the user can deploy in [[Camouflaged State]].
* If the adversary is successful in [[Discover]]ing the camouflaged Seed-Embryo, the Camouflage Marker is replaced by a Seed-Embryo Token (SEED-EMBRYO).
* If the user's Seed-Embryo profile has the [[Combat Jump]] Special Skill, it will be deployed as a Seed-Embryo (SEED-EMBRYO) Token instead of a Model, applying the Combat Jump rule as usual.
* The player will replace the Camouflage Marker or Seed-Embryo Token (SEED-EMBRYO) with the corresponding Model when:
** They perform any Skill with the [[Movement]] Label as the first Short Skill of the Order, or Entire Order. The new Developed Form profile is applied for the entire Order Sequence. 
** They perform a successful [[Dodge]] ARO. The new Developed Form Troop Profile is applied before making any Dodge movement. 


== FAQs & Errata ==

{{faqbox |
type = errata |
title = N4 Errata |
version = 1.0, Jan 2021 |
q = [Errata] Do Seed-Embryos automatically hatch in the player's second Player Turn? |
a = No. Seed-Embryos only hatch as described in the Seed-Embryo skill box. |
related = [[Seed-Embryo]] }}


{{faqbox |
type = faq |
title = N4 FAQ |
version = 1.0, Jan 2021 |
q = Q: If you pick, for example, a Seed Soldier with Forward Observer and Combi Rifle, does the Seed-Embryo Profile have them, or only the Developed Profile? |
a = A: Only the Developed Profile. |
related = [[Seed-Embryo]] }}

{{n4end}}



[[Category:Special Skills]]